app/controllers/materials_controller.rb

SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @material = Material.find(params[:id])

SELECT "materials".* FROM "materials"
---
  def index
    @materials = Material.all

INSERT INTO "materials" ("created_at", "formula", "kind", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 28 Jan 2014 14:07:35 UTC +00:00], ["formula", "dasddsa"], ["kind", "custeio"], ["name", "ghughju"], ["updated_at", Tue, 28 Jan 2014 14:07:35 UTC +00:00]]
---
  def create
    @material = Material.new(material_params)

    if @material.save

SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @material = Material.find(params[:id])

SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "materials" SET "name" = $1, "kind" = $2, "updated_at" = $3 WHERE "materials"."id" = 22  [["name", "Águaaa"], ["kind", "not_durable"], ["updated_at", Fri, 31 Jan 2014 11:33:26 UTC +00:00]]
---
  def update
    @material = Material.find(params[:id])

    if @material.update(params[:material].permit(:name, :formula))

SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "materials" WHERE "materials"."id" = $1  [["id", 1]]
---
  def destroy
    @material = Material.find(params[:id])
    @material.destroy