app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("created_at", "name", "quantity", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 05 Jan 2014 15:51:38 UTC +00:00], ["name", "Teste"], ["quantity", 5], ["updated_at", Sun, 05 Jan 2014 15:51:38 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    if @product.update(params[:product].permit(:name, :quantity))
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "name" = ?, "quantity" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["name", "TesteXG"], ["quantity", 7], ["updated_at", Sat, 04 Jan 2014 20:10:58 UTC +00:00]]